#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖[32m[1mSuccess![0m The configuration is valid.
[0m

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[33mRunning plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
The remote workspace is configured to work with configuration at
/terraform/ relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/resume/resume/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/resume/resume

[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/devious/resume/runs/run-6G59Dd5KncpufjWn[0m
[0m
Waiting for the plan to start...

Terraform v0.14.8
Configuring remote state backend...
Initializing Terraform configuration...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_iam_policy.s3crr_for_resume-devious-one_to_my-hosted-resume[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_policy" "s3crr_for_resume-devious-one_to_my-hosted-resume" {
      [32m+[0m [0m[1m[0marn[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m   = "s3crr_for_resume.devious.one_to_my-hosted-resume"
      [32m+[0m [0m[1m[0mpath[0m[0m   = "/service-role/"
      [32m+[0m [0m[1m[0mpolicy[0m[0m = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"s3:Get*",
                          [32m+[0m [0m"s3:ListBucket",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = [
                          [32m+[0m [0m"arn:aws:s3:::resume.devious.one",
                          [32m+[0m [0m"arn:aws:s3:::resume.devious.one/*",
                        ]
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"s3:ReplicateObject",
                          [32m+[0m [0m"s3:ReplicateDelete",
                          [32m+[0m [0m"s3:ReplicateTags",
                          [32m+[0m [0m"s3:GetObjectVersionTagging",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "arn:aws:s3:::my-hosted-resume/*"
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
    }

[1m  # aws_iam_role.S3_Admin_Access[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "S3_Admin_Access" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "ec2.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "S3_Admin_Access"
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # aws_iam_role.s3crr_role_for_devious1775-v_to_devious1775-cross-region-replica[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "s3crr_role_for_devious1775-v_to_devious1775-cross-region-replica" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "s3.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "s3crr_role_for_devious1775-v_to_devious1775-cross-region-replica"
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/service-role/"
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # aws_iam_role.s3crr_role_for_resume-devious-one_to_my-hosted-resume[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "s3crr_role_for_resume-devious-one_to_my-hosted-resume" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "s3.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "s3crr_role_for_resume.devious.one_to_my-hosted-resume"
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/service-role/"
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # aws_route53_record._85b00d871a5cd862e121241ba5d8c15f-resume-devious-one-CNAME[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route53_record" "_85b00d871a5cd862e121241ba5d8c15f-resume-devious-one-CNAME" {
      [32m+[0m [0m[1m[0mallow_overwrite[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mfqdn[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m            = "_85b00d871a5cd862e121241ba5d8c15f.resume.devious.one"
      [32m+[0m [0m[1m[0mrecords[0m[0m         = [
          [32m+[0m [0m"_e527b250351b59fd10b4b95d929397cd.mzlfeqexyx.acm-validations.aws.",
        ]
      [32m+[0m [0m[1m[0mttl[0m[0m             = 300
      [32m+[0m [0m[1m[0mtype[0m[0m            = "CNAME"
      [32m+[0m [0m[1m[0mzone_id[0m[0m         = "Z2WJH5BFPC71M3"
    }

[1m  # aws_route53_record.devious-one-NS[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route53_record" "devious-one-NS" {
      [32m+[0m [0m[1m[0mallow_overwrite[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mfqdn[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m            = "devious.one"
      [32m+[0m [0m[1m[0mrecords[0m[0m         = [
          [32m+[0m [0m"ns-126.awsdns-15.com.",
          [32m+[0m [0m"ns-1351.awsdns-40.org.",
          [32m+[0m [0m"ns-1875.awsdns-42.co.uk.",
          [32m+[0m [0m"ns-951.awsdns-54.net.",
        ]
      [32m+[0m [0m[1m[0mttl[0m[0m             = 172800
      [32m+[0m [0m[1m[0mtype[0m[0m            = "NS"
      [32m+[0m [0m[1m[0mzone_id[0m[0m         = "Z2WJH5BFPC71M3"
    }

[1m  # aws_route53_record.devious-one-SOA[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route53_record" "devious-one-SOA" {
      [32m+[0m [0m[1m[0mallow_overwrite[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mfqdn[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m            = "devious.one"
      [32m+[0m [0m[1m[0mrecords[0m[0m         = [
          [32m+[0m [0m"ns-1351.awsdns-40.org. awsdns-hostmaster.amazon.com. 1 7200 900 1209600 86400",
        ]
      [32m+[0m [0m[1m[0mttl[0m[0m             = 300
      [32m+[0m [0m[1m[0mtype[0m[0m            = "SOA"
      [32m+[0m [0m[1m[0mzone_id[0m[0m         = "Z2WJH5BFPC71M3"
    }

[1m  # aws_route53_record.resume-devious-one-A[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route53_record" "resume-devious-one-A" {
      [32m+[0m [0m[1m[0mallow_overwrite[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mfqdn[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m            = "resume.devious.one"
      [32m+[0m [0m[1m[0mtype[0m[0m            = "A"
      [32m+[0m [0m[1m[0mzone_id[0m[0m         = "Z2WJH5BFPC71M3"

      [32m+[0m [0malias {
          [32m+[0m [0m[1m[0mevaluate_target_health[0m[0m = false
          [32m+[0m [0m[1m[0mname[0m[0m                   = "d1zo8ltkxx4133.cloudfront.net"
          [32m+[0m [0m[1m[0mzone_id[0m[0m                = "Z2FDTNDATAQYW2"
        }
    }

[1m  # aws_route53_zone.devious-one-public[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route53_zone" "devious-one-public" {
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m          = "devious.one"
      [32m+[0m [0m[1m[0mname_servers[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mzone_id[0m[0m       = (known after apply)
    }

[1m  # aws_s3_bucket.my-hosted-resume[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket" "my-hosted-resume" {
      [32m+[0m [0m[1m[0macceleration_status[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0macl[0m[0m                         = "private"
      [32m+[0m [0m[1m[0marn[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mbucket[0m[0m                      = "my-hosted-resume"
      [32m+[0m [0m[1m[0mbucket_domain_name[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mbucket_regional_domain_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m                      = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "s3:GetObject"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mAWS = "*"
                        }
                      [32m+[0m [0mResource  = "arn:aws:s3:::my-hosted-resume/*"
                      [32m+[0m [0mSid       = "AllowPublicRead"
                    },
                ]
              [32m+[0m [0mVersion   = "2008-10-17"
            }
        )
      [32m+[0m [0m[1m[0mregion[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mrequest_payer[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_domain[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_endpoint[0m[0m            = (known after apply)

      [32m+[0m [0mversioning {
          [32m+[0m [0m[1m[0menabled[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mmfa_delete[0m[0m = (known after apply)
        }
    }

[1m  # aws_s3_bucket.resume-devious-one[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket" "resume-devious-one" {
      [32m+[0m [0m[1m[0macceleration_status[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0macl[0m[0m                         = "private"
      [32m+[0m [0m[1m[0marn[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mbucket[0m[0m                      = "resume.devious.one"
      [32m+[0m [0m[1m[0mbucket_domain_name[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mbucket_regional_domain_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m                      = jsonencode(
            {
              [32m+[0m [0mId        = "PolicyForCloudFrontPrivateContent"
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "s3:GetObject"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mAWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E3GCE4EG15FM3K"
                        }
                      [32m+[0m [0mResource  = "arn:aws:s3:::resume.devious.one/*"
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mregion[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mrequest_payer[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_domain[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_endpoint[0m[0m            = (known after apply)

      [32m+[0m [0mversioning {
          [32m+[0m [0m[1m[0menabled[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mmfa_delete[0m[0m = (known after apply)
        }
    }

[0m[1mPlan:[0m 11 to add, 0 to change, 0 to destroy.[0m
```

</details>

*Pusher: @todd814, Action: `pull_request`, Working Directory: `./terraform`, Workflow: `Terraform Plan & Test`*